demo-output/website/campaign/F3_runs/cone/M2.35_th10/fine/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}

mergeType points;

scale 1;

vertices
(
    (-0.300000000000 0.000000000000 0.000000000000)
    (0.000000000000 0.000000000000 0.000000000000)
    (0.000000000000 0.806000680717 0.035190749705)
    (-0.300000000000 0.806000680717 0.035190749705)
    (0.000000000000 0.806000680717 -0.035190749705)
    (-0.300000000000 0.806000680717 -0.035190749705)
    (1.000000000000 0.176326980708 0.007698602238)
    (1.000000000000 0.176326980708 -0.007698602238)
    (1.000000000000 0.806000680717 0.035190749705)
    (1.000000000000 0.806000680717 -0.035190749705)
);

blocks
(
    hex (0 1 4 5 0 1 2 3) (120 80 1) simpleGrading (1 1 1)
    hex (1 7 9 4 1 6 8 2) (240 80 1) simpleGrading (1 1 1)
);

edges
(
);

boundary
(
    inlet
    {
        type patch;
        faces ((0 3 5 0));
    }
    outlet
    {
        type patch;
        faces ((6 8 9 7));
    }
    axis
    {
        type empty;
        faces ((0 1 1 0));
    }
    cone
    {
        type wall;
        faces ((1 6 7 1));
    }
    farfield
    {
        type patch;
        faces ((3 2 4 5)(2 8 9 4));
    }
    frontWedge
    {
        type wedge;
        faces ((0 1 2 3)(1 6 8 2));
    }
    backWedge
    {
        type wedge;
        faces ((0 5 4 1)(1 4 9 7));
    }
);

mergePatchPairs
(
);
