demo-output/website/campaign/F3_runs/cone/M2.35_th10/fine/constant/turbulenceProperties
/*--------------------------------*- C++ -*----------------------------------*\
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      turbulenceProperties;
}

simulationType laminar;
